**6.4 Interacting with DB**

In [22]:
import pandas as pd
import sqlite3
import sqlalchemy as sqla

In [7]:
query =""" CREATE TABLE test (a VARCHAR(20), b VARCHAR(20));"""

In [8]:
con = sqlite3.connect('mydata.sqlite')

In [11]:
con.execute(query)

OperationalError: table test already exists

In [10]:
con.commit()

In [16]:
data = [('Atlanta', 'Georgia'),
.....: ('Tallahassee', 'Florida'),
.....: ('Sacramento', 'California')]
stmt = "INSERT INTO test VALUES(?, ?)"
con.executemany(stmt,data)

In [17]:
con.commit()

In [19]:
con.execute('select * from test').fetchall()

[('Atlanta', 'Georgia'),
 ('Tallahassee', 'Florida'),
 ('Sacramento', 'California')]

In [20]:
con.execute('select * from test').description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None))

SQLAlchemy:

In [23]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [25]:
pd.read_sql('select * from test', db)

             a           b
0      Atlanta     Georgia
1  Tallahassee     Florida
2   Sacramento  California